var sy = { 'xiao': '笑', 'xiaoku': '笑哭', 'se': '色', 'qin': '亲', 'ku': '酷', 'yun': '云', 'fennu': '愤怒', 'shengqi': '生气', 'nu': '怒', 'si': '四', 'gui': '龟', 'waixingren': '外星人', 'shi': '十', 'nanhai': '男孩', 'didi': '弟弟', 'nansheng': '男生', 'nanren': '男人', 'nan': '男', 'nvhai': '女孩', 'nvsheng': '女生', 'nvren': '女人', 'nv': '女', 'yeye': '爷爷', 'ye': '耶', 'laoren': '老人', 'laozi': '老子', 'lao': '老', 'jingcha': '警察', 'gongren': '工人', 'nongmingong': '农民工', 'tuzi': '兔子', 'shengdan': '圣诞', 'shengdanlaoren': '圣诞老人', 'zou': '走', 'pao': '跑', 'tiaowu': '跳舞', 'wu': '五', 'jiaren': '家人', 'qiangzhuang': '强壮', 'qiang': '强', 'zhuang': '壮', 'jirou': '肌肉', 'tui': '腿', 'jiao': '蕉', 'zu': '足', 'zhi': '纸', 'zuo': '左', 'you': '有', 'shang': '上', 'xia': '下', 'jiandaoshou': '剪刀手', 'bixin': '笔芯', 'shouzhang': '手掌', 'shou': '手', 'ok': 'ok', 'haode': '好的', 'hao': '好', 'dianzan': '点赞', 'zan': '赞', 'bang': '棒', 'cha': '差', 'huai': '坏', 'quan': '圈', 'bu': '八', 'huishou': '回收', 'guzhang': '鼓掌', 'pa': '爬', 'jushou': '举手', 'heshi': '合十', 'qidao': '祈祷', 'woshou': '握手', 'erduo': '耳朵', 'er': '二', 'bi': '笔', 'bizi': '鼻子', 'yanjing': '眼镜', 'jiaoyin': '脚印', 'zuji': '足迹', 'danao': '大脑', 'gutou': '骨头', 'gu': '骨', 'yachi': '牙齿', 'chi': '尺', 'tian': '舔', 'zui': '嘴', 'taiyangjing': '太阳镜', 'Txu': 'T恤', 'wazi': '袜子', 'wa': '袜', 'qunzi': '裙子', 'qun': '裙', 'bijini': '比基尼', 'nvzhuang': '女装', 'qianbao': '钱包', 'shoutidai': '手提袋', 'bao': '包', 'xie': '蟹', 'xiezi': '鞋子', 'gaogenxie': '高跟鞋', 'maozi': '帽子', 'kouhong': '口红', 'xingli': '行李', 'yusan': '雨伞', 'san': '三', 'mengyan': '蒙眼', 'meiyankan': '没眼看', 'buting': '不听', 'bushuohua': '不说话', 'jinyan': '禁言', 'baozha': '爆炸', 'zha': '炸', 'di': '滴', 'ben': '本', 'benpao': '奔跑', 'hou': '猴', 'houzi': '猴子', 'gou': '狗', 'mao': '猫', 'huanxiong': '浣熊', 'shizi': '狮子', 'ma': '妈', 'laohu': '老虎', 'hu': '虎', 'banma': '斑马', 'niu': '牛', 'zhu': '祝', 'zhubi': '猪鼻', 'luotuo': '骆驼', 'tuo': '驼', 'changjinglu': '长颈鹿', 'daxiang': '大象', 'xiang': '象', 'laoshu': '老鼠', 'shu': '书', 'tu': '兔', 'xiong': '熊', 'kaola': '考拉', 'xiongmao': '熊猫', 'daishu': '袋鼠', 'ji': '记', 'gongji': '公鸡', 'niao': '鸟', 'gezi': '鸽子', 'ge': '割', 'qie': '企鹅', 'tengxun': '腾讯', 'laoying': '老鹰', 'ying': '鹰', 'yazi': '鸭子', 'ya': '鸭', 'tiane': '天鹅', 'yingwu': '鹦鹉', 'hama': '蛤蟆', 'ha': '蛤', 'guai': '乖', 'she': '射', 'nongmin': '农民', 'long': '龙', 'jingyu': '鲸鱼', 'jing': '井', 'haitun': '海豚', 'tun': '豚', 'daiyu': '带鱼', 'shayu': '鲨鱼', 'sha': '沙', 'zhangyu': '章鱼', 'zhang': '章', 'pangxie': '螃蟹', 'longxia': '龙虾', 'wuzei': '乌贼', 'woniu': '蜗牛', 'hudie': '蝴蝶', 'die': '蝶', 'chong': '虫', 'chongzi': '虫子', 'mayi': '蚂蚁', 'yi': '一', 'mifeng': '蜜蜂', 'feng': '蜂', 'piaochong': '瓢虫', 'piao': '票', 'zhizhu': '蜘蛛', 'zhuwang': '蛛网', 'huaduo': '花朵', 'xianhua': '鲜花', 'hua': '画', 'meigui': '玫瑰', 'xiangrikui': '向日葵', 'xianrenzhang': '仙人掌', 'siyecao': '四叶草', 'fengye': '枫叶', 'luoye': '落叶', 'diqiu': '地球', 'shijie': '世界', 'yueliang': '月亮', 'ri': '日', 'taiyang': '太阳', 'xing': '星', 'mingxing': '明星', 'duoyun': '多云', 'xiayu': '下雨', 'yu': '雨', 'xiaxue': '下雪', 'longjuanfeng': '龙卷风', 'caihong': '彩虹', 'shandian': '闪电', 'gaoyadian': '高压电', 'dian': '电', 'xuehua': '雪花', 'xue': '雪', 'xueren': '雪人', 'shui': '睡', 'huo': '火', 'bolang': '波浪', 'bo': '波', 'shengdanshu': '圣诞树', 'shan': '山', 'putao': '葡萄', 'xigua': '西瓜', 'gua': '瓜', 'ningmeng': '柠檬', 'suan': '酸', 'xiangjiao': '香蕉', 'boluo': '菠萝', 'fengli': '凤梨', 'pingguo': '苹果', 'li': '礼', 'lizi': '梨子', 'taozi': '桃子', 'tao': '桃', 'yingtao': '樱桃', 'caomei': '草莓', 'mihoutao': '猕猴桃', 'xihongshi': '西红柿', 'qiezi': '茄子', 'jia': '加', 'tudou': '土豆', 'fanshu': '番薯', 'huluobo': '胡萝卜', 'luobo': '萝卜', 'lajiao': '辣椒', 'na': '那', 'la': '辣', 'huanggua': '黄瓜', 'mogu': '蘑菇', 'huasheng': '花生', 'mianbao': '面包', 'jianbing': '煎饼', 'laobing': '烙饼', 'nailao': '奶酪', 'rou': '肉', 'jitui': '鸡腿', 'peigen': '培根', 'yan': '烟', 'baomihua': '爆米花', 'tang': '糖', 'jian': '减', 'sanmingzhi': '三明治', 'regou': '热狗', 'huotui': '火腿', 'pisa': '披萨', 'shutiao': '薯条', 'hanbao': '汉堡', 'hanpubao': '汉堡包', 'niunai': '牛奶', 'naiping': '奶瓶', 'tiantianquan': '甜甜圈', 'qiaokelibang': '巧克力棒', 'qiaokeli': '巧克力', 'shengridangao': '生日蛋糕', 'dangao': '蛋糕', 'quqi': '曲奇', 'bingqilin': '冰淇淋', 'jiaozi': '饺子', 'yuebing': '月饼', 'shousi': '寿司', 'miantiao': '面条', 'mian': '面', 'fan': '饭', 'mifan': '米饭', 'fantuan': '饭团', 'canju': '惨剧', 'shaozi': '勺子', 'kuaizi': '筷子', 'kuai': '筷', 'ganbei': '干杯', 'pijiu': '啤酒', 'pi': '批', 'jiu': '九', 'jiubei': '酒杯', 'feiji': '飞机', 'chuan': '船', 'honglvdeng': '红绿灯', 'jiayou': '加油', 'danche': '单车', 'zixingche': '自行车', 'tuolaji': '拖拉机', 'che': '车', 'qiche': '骑车', 'chuzuche': '出租车', 'jingche': '警车', 'xiaofangche': '消防车', 'jijiuche': '急救车', 'gongjiaoche': '公交车', 'gonggongqiche': '公共汽车', 'ditie': '地铁', 'huoche': '火车', 'gaotie': '高铁', 'xuexiao': '学校', 'lvguan': '旅馆', 'binguan': '宾馆', 'yinhang': '银行', 'yiyuan': '医院', 'fangzi': '房子', 'jiating': '家庭', 'haosi': '好死', 'budehaosi': '不得好死', 'huoshan': '火山', 'motuo': '摩托', 'motuoche': '摩托车', 'saiche': '赛车', 'shixiang': '石像', 'yanhua': '烟花', 'liuxing': '流星', 'feidie': '飞碟', 'huojian': '火箭', 'renzaoweixing': '人造卫星', 'weixing': '卫星', 'zuowei': '座位', 'qima': '骑马', 'huaxue': '滑雪', 'youyong': '游泳', 'daqiu': '打球', 'juzhong': '举重', 'xunzhang': '勋章', 'jiangbei': '奖杯', 'jiangpai': '奖牌', 'zuqiu': '足球', 'bangqiu': '棒球', 'lanqiu': '篮球', 'paiqiu': '排球', 'ganlanqiu': '橄榄球', 'wangqiu': '网球', 'baolingqiu': '保龄球', 'pingpangqiu': '乒乓球', 'yumaoqiu': '羽毛球', 'quanji': '拳击', 'yugan': '鱼竿', 'diaoyu': '钓鱼', 'youxi': '游戏', 'dayouxi': '打游戏', 'touzi': '骰子', 'shaizi': '色子', 'huaban': '画板', 'yishu': '艺术', 'maoxian': '毛线', 'huatong': '话筒', 'erji': '耳机', 'sakesi': '萨克斯', 'jita': '吉他', 'gangqin': '钢琴', 'laba': '喇叭', 'xiaotiqin': '小提琴', 'jianji': '剪辑', 'dianying': '电影', 'shejian': '射箭', 'qingshu': '情书', 'dong': '洞', 'zhadan': '炸弹', 'xizao': '洗澡', 'shuijiao': '睡觉', 'dao': '刀', 'shijieditu': '世界地图', 'zhinanzhen': '指南针', 'zhuan': '砖', 'ling': '零', 'xiangling': '响铃', 'shalou': '沙漏', 'biao': '表', 'naozhong': '闹钟', 'zhong': '中', 'wenduji': '温度计', 'miehuoqi': '灭火器', 'qiqiu': '气球', 'gongxi': '恭喜', 'zhuhe': '祝贺', 'ribenren': '日本人', 'liyuqi': '鲤鱼旗', 'hongbao': '红包', 'hudiejie': '蝴蝶结', 'liwu': '礼物', 'shuijingqiu': '水晶球', 'taidixiong': '泰迪熊', 'xian': '线', 'gouwudai': '购物袋', 'zuanshi': '钻石', 'zuan': '钻', 'shouyinji': '收音机', 'shouting': '收听', 'shouji': '手机', 'dianhua': '电话', 'dianchi': '电池', 'chatou': '插头', 'diannao': '电脑', 'jianpan': '键盘', 'dayinji': '打印机', 'dayin': '打印', 'shubiao': '鼠标', 'yingpan': '硬盘', 'guangpan': '光盘', 'DVD': 'DVD', 'suanpan': '算盘', 'sheyingji': '摄影机', 'fangying': '放映', 'shangying': '上映', 'dianshi': '电视', 'xiangji': '相机', 'zhaoxiangji': '照相机', 'luxiangji': '录像机', 'ai': '爱', 'fangdajing': '放大镜', 'fangda': '放大', 'lazhu': '蜡烛', 'deng': '灯', 'liang': '亮', 'shoudiantong': '手电筒', 'bijiben': '笔记本', 'baozhi': '报纸', 'shuqian': '书签', 'biaoqian': '标签', 'qiandai': '钱袋', 'riyuan': '日元', 'meiyuan': '美元', 'ouyuan': '欧元', 'xinyongka': '信用卡', 'shouju': '收据', 'xinfeng': '信封', 'xin': '新', 'youjian': '邮件', 'fasong': '发送', 'jieshou': '接收', 'shoudao': '收到', 'youxiang': '邮箱', 'qianbi': '铅笔', 'gangbi': '钢笔', 'huabi': '画笔', 'labi': '蜡笔', 'beiwanglu': '备忘录', 'bianqian': '便签', 'wenjianjia': '文件夹', 'rili': '日历', 'zengzhang': '增长', 'zengjia': '增加', 'zengda': '增大', 'zeng': '增', 'xiajiang': '下降', 'jiangdi': '降低', 'jianshao': '减少', 'jiang': '降', 'tuding': '图钉', 'huixingzhen': '回形针', 'chizi': '尺子', 'jiandao': '剪刀', 'lajitong': '垃圾桶', 'suo': '锁', 'yaoshi': '钥匙', 'chuizi': '锤子', 'bishou': '匕首', 'shouqiang': '手枪', 'dunpai': '盾牌', 'xiuli': '修理', 'xiu': '修', 'banshou': '扳手', 'chilun': '齿轮', 'tianping': '天平', 'lianjie': '连接', 'suolian': '锁链', 'gongjuxiang': '工具箱', 'cili': '磁力', 'ci': '磁', 'citie': '磁铁', 'shiguan': '试管', 'DNA': 'DNA', 'jiyin': '基因', 'xianweijing': '显微镜', 'wangyuanjing': '望远镜', 'leida': '雷达', 'zhen': '针', 'yao': '要', 'men': '们', 'chuang': '床', 'cesuo': '厕所', 'matong': '马桶', 'linyu': '淋浴', 'yugang': '浴缸', 'xijiejing': '洗洁精', 'sao': '扫', 'saozhou': '扫帚', 'saoba': '扫把', 'lanzi': '篮子', 'juanzhi': '卷纸', 'weishengzhi': '卫生纸', 'feizao': '肥皂', 'zao': '皂', 'haimian': '海绵', 'xiangyan': '香烟', 'zhaxin': '扎心', 'xindong': '心动', 'xintiao': '心跳', 'xinxinxiangyin': '心心相印', 'xinxiangyin': '心相印', 'xinsui': '心碎', 'heixin': '黑心', 'manfen': '满分', '100fen': '100分', 'xinxi': '信息', 'xiangfa': '想法', 'hunshui': '昏睡', 'kun': '困', 'zheng': '蒸', 'ting': '停', 'xuanfeng': '旋风', 'jufeng': '飓风', 'heitao': '黑桃', 'hongtao': '红桃', 'fangkuai': '方块', 'meihua': '梅花', 'pai': '牌', 'puke': '扑克', 'hongzhong': '红中', 'jingyin': '静音', 'yinliang': '音量', 'lingdang': '铃铛', 'yinyue': '音乐', 'yin': '音', 'ATM': 'ATM', 'lunyi': '轮椅', 'canjiren': '残疾人', 'nance': '男厕', 'nvce': '女厕', 'yinger': '婴儿', 'jinggao': '警告', 'jinzhijinru': '禁止进入', 'jinzhi': '禁止', 'chengren': '成人', 'seqing': '色情', 'fushe': '辐射', 'shangxia': '上下', 'zuoyou': '左右', 'xunhuan': '循环', 'raoquan': '绕圈', 'rao': '绕', 'fanhui': '返回', 'yuanzi': '原子', 'yinyang': '阴阳', 'qingzhen': '清真', 'yisilan': '伊斯兰', 'musilin': '穆斯林', 'baiyangzuo': '白羊座', 'jinniuzuo': '金牛座', 'shuangzizuo': '双子座', 'juxiezuo': '巨蟹座', 'shizizuo': '狮子座', 'chunvzuo': '处女座', 'tianchengzuo': '天秤座', 'tianxiezuo': '天蝎座', 'sheshouzuo': '射手座', 'mojiezuo': '摩羯座', 'shuipingzuo': '水瓶座', 'shuangyuzuo': '双鱼座', 'shefuzuo': '蛇夫座', 'zhongfang': '重放', 'danquxunhuan': '单曲循环', 'bofang': '播放', 'kuaijin': '快进', 'fanhuijian': '返回键', 'kuaitui': '快退', 'zanting': '暂停', 'tuichu': '退出', 'dianyingyuan': '电影院', 'xinhao': '信号', 'wuqiong': '无穷', 'wuxian': '无限', 'sanchaji': '三叉戟', 'yuan': '圆', 'dui': '对', 'cuo': '错', 'chu': '除', '?': '?', '!': '!', '0': '0', '1': '1', '2': '2', '3': '3', '4': '4', '5': '5', '6': '6', '7': '7', '8': '8', '9': '9', '10': '10', 'mianfei': '免费', 'yue': '月', 'de': '得', 'jin': '禁', 'ke': '可', 'shen': '申', 'kong': '空', 'mi': '秘', 'man': '满', 'liu': '六', 'qi': '七', 'ba': '八', "jie": "结", "huan": "环" },
    light = {
        '笑': '😁',
        '笑哭': '😂',
        '色': '😍',
        '亲': '💋',
        '哭': '😭',
        '晕': '😵',
        '愤怒': '👿',
        '生气': '👿',
        '怒': '💢',
        '死': '💀',
        '鬼': '👻',
        '外星人': '👽',
        '屎': '💩',
        '男孩': '👦',
        '弟弟': '👦',
        '男生': '👦',
        '男人': '👨',
        '男': '👨',
        '女孩': '👧',
        '女生': '👧',
        '女人': '👩',
        '女': '👩',
        '爷爷': '👴',
        '爷': '👴',
        '老人': '👴',
        '老子': '👴',
        '老': '👴',
        '警察': '👮',
        '工人': '👷',
        '农民工': '👷',
        '秃子': '👨',
        '圣诞': '🎅',
        '圣诞老人': '🎅',
        '走': '🚶',
        '跑': '🏃',
        '跳舞': '💃',
        '舞': '💃',
        '家人': '👪',
        '强壮': '💪',
        '强': '💪',
        '壮': '💪',
        '肌肉': '💪',
        '腿': '🦵',
        '脚': '🦶',
        '足': '🦶',
        '指': '👈',
        '左': '⬅',
        '右': '➡',
        '上': '⬆',
        '下': '⬇',
        '耶': '✌️',
        '剪刀手': '✌️',
        '比心': '🤞',
        '笔芯': '🤞',
        '手掌': '🖐️',
        '手': '🖐️',
        'ok': '👌',
        '好的': '👌',
        '好': '👌',
        "点": "丶",
        '点赞': '丶👍',
        '赞': '👍',
        '棒': '👍',
        '差': '👎',
        '坏': '👎',
        '拳': '👊',
        '不': '8️⃣',
        '挥手': '👋',
        '鼓掌': '👏',
        '啪': '👏',
        '举手': '🙌',
        '合十': '🈴',
        '祈祷': '🙏',
        '握手': '🤝',
        '耳朵': '👂',
        '耳': '👂',
        '鼻': '👃',
        '鼻子': '👃',
        '眼睛': '👀',
        '脚印': '👣',
        '足迹': '👣',
        '大脑': '🧠',
        '智': '🧠',
        '骨头': '🦴',
        '骨': '🦴',
        '牙齿': '🦷',
        '齿': '🦷',
        '舔': '👅',
        '嘴': '👄',
        '眼镜': '👓',
        '太阳镜': '🕶️',
        'T恤': '👕',
        '袜子': '🧦',
        '袜': '🧦',
        '裙子': '👗',
        '裙': '👗',
        '比基尼': '👙',
        '女装': '👚',
        '钱包': '👛',
        '手提袋': '👜',
        '包': '📦',
        '鞋': '👞',
        '鞋子': '👞',
        '高跟鞋': '👠',
        '帽子': '🎩',
        '口红': '💄',
        '行李': '🧳',
        '雨伞': '☂️',
        '伞': '☂️',
        '蒙眼': '🙈',
        '没眼看': '🙈',
        '不听': '🙉',
        '不说话': '🙊',
        '禁言': '🙊',
        '爆炸': '💥',
        '炸': '💥',
        '滴': '💦',
        '奔': '💨',
        '奔跑': '🏃💨',
        '猴': '🐵',
        '猴子': '🐵',
        '狗': '🐶',
        '猫': '🐱',
        '浣熊': '🦝',
        '狮子': '🦁',
        '狮': '🦁',
        '马': '🐴',
        '妈': '🐴',
        '老虎': '🐯',
        '虎': '🐯',
        '斑马': '🦓',
        '牛': '🐮',
        '猪': '🐷',
        '猪鼻': '🐽',
        '骆驼': '🐫',
        '驼': '🐫',
        '长颈鹿': '🦒',
        '大象': '🐘',
        '象': '🐘',
        '老鼠': '🐭',
        '鼠': '🐭',
        '兔子': '🐰',
        '兔': '🐰',
        '熊': '🐻',
        '考拉': '🐨',
        '熊猫': '🐼',
        '袋鼠': '🦘',
        '鸡': '🐔',
        '公鸡': '🐓',
        '鸟': '🐦',
        '鸽子': '🕊️',
        '鸽': '🕊️',
        '企鹅': '🐧',
        '腾讯': '🐧',
        '老鹰': '🦅',
        '鹰': '🦅',
        '鸭子': '🦆',
        '鸭': '🦆',
        '天鹅': '🦢',
        '鹦鹉': '🦜',
        '蛤蟆': '🐸',
        '蛤': '🐸',
        '龟': '🐢',
        '乖': '🐢',
        '蛇': '🐍',
        '射': '🐍',
        '农民': '🐲鸣',
        '龙': '🐲',
        '鲸鱼': '🐋',
        '鲸': '🐋',
        '海豚': '🐬',
        '豚': '🐬',
        '带鱼': '🐠',
        '鲨鱼': '🦈',
        '鲨': '🦈',
        '章鱼': '🐙',
        '章': '🐙',
        '螃蟹': '🦀',
        '蟹': '🦀',
        '龙虾': '🦞',
        '虾': '🦐',
        '乌贼': '🦑',
        '蜗牛': '🐌',
        '蝴蝶': '🦋',
        '蝶': '🦋',
        '虫': '🐛',
        '虫子': '🐛',
        '蚂蚁': '🐜',
        '蚁': '🐜',
        '蜜蜂': '🐝',
        '蜂': '🐝',
        '瓢虫': '🐞',
        '嫖': '🐞',
        '瓢': '🐞',
        '蜘蛛': '🕷️',
        '蛛': '🕷️',
        '蛛网': '🕸️',
        '花朵': '🌸',
        '鲜花': '🌸',
        '花': '🌸',
        '玫瑰': '🌹',
        '向日葵': '🌻',
        '树': '🌲',
        '仙人掌': '🌵',
        '四叶草': '🍀',
        '枫叶': '🍁',
        '落叶': '🍂',
        '地球': '🌏',
        '世界': '🌏',
        '月亮': '🌙',
        '日': '☀️',
        '太阳': '☀️',
        '星': '⭐',
        '明星': '🌟',
        '云': '☁️',
        '多云': '⛅',
        '下雨': '🌧️',
        '雨': '🌧️',
        '下雪': '🌨️',
        '龙卷风': '🌪️',
        '雾': '🌫️',
        '彩虹': '🌈',
        '闪电': '⚡',
        '高压电': '⚡',
        '电': '⚡',
        '雪花': '❄️',
        '雪': '❄️',
        '雪人': '☃️',
        '水': '💧',
        '火': '🔥',
        '波浪': '🌊',
        '波': '🌊',
        '圣诞树': '🎄',
        '闪': '✨',
        '葡萄': '🍇',
        '西瓜': '🍉',
        '瓜': '🍉',
        '柠檬': '🍋',
        '酸': '🍋',
        '香蕉': '🍌',
        '蕉': '🍌',
        '菠萝': '🍍',
        '凤梨': '🍍',
        '苹果': '🍎',
        '梨': '🍐',
        '梨子': '🍐',
        '桃子': '🍑',
        '桃': '🍑',
        '樱桃': '🍒',
        '草莓': '🍓',
        '猕猴桃': '🥝',
        '西红柿': '🍅',
        '茄子': '🍆',
        '茄': '🍆',
        '土豆': '🥔',
        '番薯': '🥔',
        '胡萝卜': '🥕',
        '萝卜': '🥕',
        '辣椒': '🌶️',
        '了': '🌶️',
        '那': '🌶️',
        '辣': '🌶️',
        '黄瓜': '🥒',
        '蘑菇': '🍄',
        '花生': '🥜',
        '面包': '🍞',
        '煎饼': '🥞',
        '烙饼': '🥞',
        '奶酪': '🧀',
        '肉': '🍖',
        '鸡腿': '🍗',
        '培根': '🥓',
        '盐': '🧂',
        '爆米花': '🍿',
        '汤': '🥣',
        '煎': '🍳',
        '三明治': '🥪',
        '热狗': '🌭',
        '火腿': '🌭',
        '披萨': '🍕',
        '薯条': '🍟',
        '汉堡': '🍔',
        '汉堡包': '🍔',
        '牛奶': '🥛',
        '奶瓶': '🍼',
        '甜甜圈': '🍭',
        '糖': '🍬',
        '巧克力棒': '🍫',
        '巧克力': '🍫',
        '生日蛋糕': '🎂',
        '蛋糕': '🎂',
        '曲奇': '🍪',
        '冰淇淋': '🍦',
        '饺子': '🥟',
        '月饼': '🥮',
        '寿司': '🍣',
        '面条': '🍜',
        '面': '🍜',
        '饭': '🍚',
        '米饭': '🍚',
        '饭团': '🍙',
        '餐具': '🍴',
        '惨剧': '🍴',
        '勺子': '🥄',
        '筷子': '🥢',
        '筷': '🥢',
        '干杯': '🍻',
        '啤酒': '🍺',
        '啤': '🍺',
        '酒': '🍺',
        '批': '🍺',
        '逼': '🍺',
        '酒杯': '🍷',
        '飞机': '✈️',
        '船': '🚢',
        '红绿灯': '🚦',
        '加油': '⛽',
        '单车': '🚲',
        '自行车': '🚲',
        '拖拉机': '🚜',
        '车': '🚗',
        '汽车': '🚗',
        '出租车': '🚕',
        '警车': '🚓',
        '消防车': '🚒',
        '急救车': '🚑',
        '公交车': '🚌',
        '公共汽车': '🚌',
        '地铁': '🚇',
        '火车': '🚆',
        '高铁': '🚄',
        '学校': '🏫',
        '旅馆': '🏨',
        '宾馆': '🏨',
        '银行': '🏦',
        '医院': '🏥',
        '房子': '🏠',
        '家庭': '🏠',
        '好死': '🏠',
        '不得好死': '不得🏠',
        '火山': '🌋',
        '山': '⛰️',
        '摩托': '🏍️',
        '摩托车': '🏍️',
        '赛车': '🏎️',
        '石像': '🗿',
        '烟花': '🎆',
        '流星': '🌠',
        '飞碟': '🛸',
        '火箭': '🚀',
        '人造卫星': '🛰️',
        '卫星': '🛰️',
        '座位': '💺',
        '爬': '🧗',
        '骑马': '🏇',
        '滑雪': '⛷️',
        '游泳': '🏊',
        '游': '🏊',
        '打球': '⛹️',
        '举重': '🏋️',
        '骑车': '🚴',
        '票': '🎫',
        '勋章': '🎖️',
        '奖杯': '🏆',
        '奖牌': '🏅',
        '足球': '⚽',
        '棒球': '⚾',
        '篮球': '🏀',
        '排球': '🏐',
        '橄榄球': '🏈',
        '网球': '🎾',
        '保龄球': '🎳',
        '乒乓球': '🏓',
        '羽毛球': '🏸',
        '拳击': '🥊',
        '鱼竿': '🎣',
        '钓鱼': '🎣',
        '游戏': '🎮',
        '打游戏': '🎮',
        '骰子': '🎲',
        '色子': '🎲',
        '画板': '🎨',
        '画': '🎨',
        '艺术': '🎨',
        '毛线': '🧶',
        '话筒': '🎤',
        '耳机': '🎧',
        '萨克斯': '🎷',
        '吉他': '🎸',
        '钢琴': '🎹',
        '喇叭': '📢',
        '小提琴': '🎻',
        '剪辑': '🎬',
        '电影': '🎬',
        '射箭': '🏹',
        '情书': '💌',
        '洞': '🕳️',
        '炸弹': '💣',
        '洗澡': '🛀',
        '睡觉': '🛌',
        '睡': '🛌',
        '刀': '🔪',
        '世界地图': '🗺',
        '指南针': '🧭',
        '砖': '🧱',
        '油': '🛢',
        '铃': '🛎',
        '响铃': '🛎',
        '沙漏': '⌛',
        '沙': '⌛',
        '表': '⌚',
        '闹钟': '⏰',
        '钟': '⏰',
        '温度计': '🌡',
        '灭火器': '🧨',
        '气球': '🎈',
        '恭喜': '🎉',
        '祝贺': '🎉',
        '日本人': '🎎',
        '鲤鱼旗': '🎏',
        '红包': '🧧',
        '蝴蝶结': '🎀',
        '结': '🎀',
        '礼物': '🎁',
        '礼': '🎁',
        '水晶球': '🔮',
        '泰迪熊': '🧸',
        '线': '🧵',
        '购物袋': '🛍',
        '钻石': '💎',
        '钻': '💎',
        '收音机': '📻',
        '收听': '📻',
        '手机': '📱',
        '电话': '☎',
        '电池': '🔋',
        '插头': '🔌',
        '电脑': '💻',
        '键盘': '⌨',
        '打印机': '🖨',
        '打印': '🖨',
        '鼠标': '🖱',
        '硬盘': '💽',
        '光盘': '💿',
        'DVD': '📀',
        '算盘': '🧮',
        '摄影机': '🎥',
        '放映': '📽',
        '上映': '📽',
        '电视': '📺',
        '相机': '📷',
        '照相机': '📷',
        '录像机': '📹',
        '放大镜': '🔍',
        '放大': '🔍',
        '蜡烛': '🕯',
        '灯': '💡',
        '亮': '💡',
        '手电筒': '🔦',
        '笔记本': '📔',
        '本': '📕',
        '书': '📕',
        '纸': '📄',
        '报纸': '📰',
        '书签': '📑',
        '标签': '🏷',
        '钱袋': '💰',
        '日元': '💴',
        '美元': '💵',
        '欧元': '💶',
        '信用卡': '💳',
        '收据': '🧾',
        '信封': '✉',
        '信': '✉',
        '邮件': '📧',
        '发送': '📤',
        '接收': '📥',
        '收到': '📥',
        '邮箱': '📮',
        '铅笔': '✏',
        '钢笔': '🖊',
        '笔': '🖊',
        '画笔': '🖌',
        '蜡笔': '🖍',
        '备忘录': '📝',
        '便签': '📝',
        '记': '📝',
        '文件夹': '📁',
        '日历': '📅',
        '增长': '📈',
        '增加': '📈',
        '增大': '📈',
        '增': '📈',
        '下降': '📉',
        '降低': '📉',
        '减少': '📉',
        '降': '📉',
        '图钉': '📌',
        '回形针': '📎',
        '尺子': '📏',
        '尺': '📏',
        '剪刀': '✂',
        '剪': '✂',
        '垃圾桶': '🗑',
        '锁': '🔒',
        '钥匙': '🔑',
        '锤子': '🔨',
        '匕首': '🗡',
        '手枪': '🔫',
        '盾牌': '🛡',
        '修理': '🔧',
        '修': '🔧',
        '扳手': '🔧',
        '齿轮': '⚙',
        '天平': '⚖',
        '连接': '🔗',
        '锁链': '⛓',
        '工具箱': '🧰',
        '磁力': '🧲',
        '磁': '🧲',
        '磁铁': '🧲',
        '试管': '🧪',
        'DNA': '🧬',
        '基因': '🧬',
        '显微镜': '🔬',
        '望远镜': '🔭',
        '雷达': '📡',
        '针': '💉',
        '药': '💊',
        '要': '💊',
        '门': '🚪',
        '们': '🚪',
        '床': '🛏',
        '厕所': '🚾',
        '马桶': '🚽',
        '淋浴': '🚿',
        '浴缸': '🛁',
        '洗洁精': '🧴',
        '扫': '🧹',
        '扫帚': '🧹',
        '扫把': '🧹',
        '篮子': '🧺',
        '卷纸': '🧻',
        '卫生纸': '🧻',
        '肥皂': '🧼',
        '皂': '🧼',
        '海绵': '🧽',
        '烟': '🚬',
        '香烟': '🚬',
        '扎心': '💘',
        '心动': '💓',
        '爱': '💓',
        '心跳': '💓',
        '心心相印': '💕',
        '心相印': '💕',
        '心碎': '💔',
        '黑心': '🖤',
        '满分': '💯',
        '100分': '💯',
        '信息': '💬',
        '想法': '💭',
        '昏睡': '💤',
        '困': '💤',
        '蒸': '♨',
        '停': '🛑',
        '旋风': '🌀',
        '飓风': '🌀',
        '黑桃': '♠',
        '红桃': '♥',
        '方块': '♦',
        '梅花': '♣',
        '牌': '🃏',
        '扑克': '🃏',
        '中': '🀄',
        '红中': '🀄',
        '静音': '🔇',
        '音量': '🔈',
        '铃铛': '🔔',
        '音乐': '🎵',
        '音': '🎵',
        'ATM': '🏧',
        '轮椅': '♿',
        '残疾人': '♿',
        '男厕': '🚹',
        '女厕': '🚺',
        '婴儿': '🚼',
        '警告': '⚠',
        '禁止进入': '⛔',
        '禁止': '🚫',
        '成人': '🔞',
        '色情': '🔞',
        '辐射': '☢',
        '上下': '↕',
        '左右': '↔',
        '循环': '🔄',
        '绕圈': '🔄',
        '绕': '🔄',
        '返回': '🔙',
        '原子': '⚛',
        '阴阳': '☯',
        '清真': '☪',
        '伊斯兰': '☪',
        '穆斯林': '☪',
        '白羊座': '♈',
        '金牛座': '♉',
        '双子座': '♊',
        '巨蟹座': '♋',
        '狮子座': '♌',
        '处女座': '♍',
        '天秤座': '♎',
        '天蝎座': '♏',
        '射手座': '♐',
        '摩羯座': '♑',
        '水瓶座': '♒',
        '双鱼座': '♓',
        '蛇夫座': '⛎',
        '重放': '🔁',
        '单曲循环': '🔂',
        '播放': '▶',
        '快进': '⏩',
        '返回键': '◀',
        '快退': '⏪',
        '暂停': '⏹',
        '退出': '⏏',
        '电影院': '🎦',
        '信号': '📶',
        '大师': '带师',
        '大哥': '带哥',
        '无穷': '♾',
        '无限': '♾',
        '回收': '♻',
        '三叉戟': '🔱',
        '环': '⭕',
        '圈': '⭕',
        '圆': '⭕',
        '对': '✅',
        '错': '❌',
        '必死': 'biss',
        '搞快点': 'GKD',
        '加': '➕',
        '减': '➖',
        '除': '➗',
        '?': '¿',
        '!': '❗',
        '井': '️⃣',
        '0': '0️⃣',
        '1': '1️⃣',
        '2': '2️⃣',
        '3': '3️⃣',
        '4': '4️⃣',
        '5': '5️⃣',
        '6': '6️⃣',
        '7': '7️⃣',
        '8': '8️⃣',
        '您': '宁',
        '9': '9️⃣',
        '10': '🔟',
        '酷': '🆒',
        '免费': '🆓',
        '新': '🆕',
        '月': '🈷',
        '有': '🈶',
        '得': '🉐',
        '割': '🈹',
        '无': '🈚',
        '禁': '🈲',
        '可': '🉑',
        '申': '🈸',
        '空': '🈳',
        '祝': '㊗',
        '秘': '㊙',
        '满': '🈵',
        '零': '0️⃣',
        '一': '1️⃣',
        '二': '2️⃣',
        '三': '3️⃣',
        '四': '4️⃣',
        "服": "佛",
        '五': '5️⃣',
        '六': '6️⃣',
        '七': '7️⃣',
        '八': '8️⃣',
        '九': '9️⃣',
        '十': '🔟',
        '?': "¿",
        '？': "¿",
        '啊': '嗷',
        '哦': '嗷',
        '呀': '嗷'
    }
const emojiRegex = require('emoji-regex');
const {
    Segment,
    useDefault
} = require('segmentit');


const regex = emojiRegex();

function isEmojiChar(text) {
    if (regex.exec(text) == null) {
        if (regex.exec(text) == null) {
            return false
        } else {
            if (text.search(/[\u{4e00}-\u{9fa5}_a-zA-Z0-9]/ug) == -1) {
                return true
            } else {
                return false
            }

        }
    }
    if (text.search(/[\u{4e00}-\u{9fa5}_a-zA-Z0-9]/ug) == -1) {
        return true
    } else {
        return false
    }
}

const segmentit = useDefault(new Segment());
var inst = new mdui.Tab('#tab'), index = 0;
document.getElementById('tab').addEventListener('change.mdui.tab', function (event) {
    index = event._detail.index
});

const getTextFeature = (text, color) => {
    try {
        const canvas = document.createElement('canvas');
        /*
          因为进行scale以后的图案区域实际上不能确定，
          理论上应该只在(0,0,1,1)，但有的也会在它周围的像素里，
          综合效率的考虑，给一个2*2的范围是比较合适的;
        */
        canvas.width = 2;
        canvas.height = 2;

        const ctx = canvas.getContext('2d');
        ctx.textBaseline = 'top';
        ctx.font = '100px sans-serif';
        ctx.fillStyle = color;
        ctx.scale(0.01, 0.01);
        ctx.fillText(text, 0, 0);

        const imageData = ctx.getImageData(0, 0, 2, 2).data;
        // 在一些系统里Uint8ClampedArray不支持常规的数组方法，需要转换一下
        const imageDataArr = [];
        for (let i = 0; i < imageData.length; i++) {
            imageDataArr[i] = imageData[i];
        }

        return imageDataArr.reduce((a, b) => (a + b), 0) > 0 ?
            imageDataArr.toString() : false;
    } catch (e) {
        return false;
    }
};

const distribute = (text, mode) => {
    const feature = getTextFeature(text, '#000');
    return mode ? (feature && feature === getTextFeature(text, '#FFF'))
        : feature;
};

const ifEmoji = (text) => {
    const mode = distribute('😁');
    return distribute(text, mode);
}
var bfl = Object.assign({}, light), bfsy = Object.assign({}, sy)
Object.keys(light).forEach(function (key) {
    if (!ifEmoji(light[key]) && isEmojiChar(light[key])) {
        eval("delete bfl." + key)
        eval("delete bfsy." + pinyinUtil.getPinyin(key, '', false, true))
    }
});

$("#up").click(function () {
    var res = ''
    console.log(index, 1)
    if (index == 0) {
        var k = $("#t").val(),
            jieba = segmentit.doSegment(k),
            ck = light,
            indexa = sy
        if ($("input[id='checklook']").is(':checked') == true) {
            ck = bfl, indexa = bfsy
        }
        console.log(jieba)
        if ($("input[name='group1']:checked").val() == "1") {
            for (i = 0, len = jieba.length; i < len; i++) {
                var word = jieba[i]['w'].trim()
                if (typeof (ck[word]) != "undefined") {
                    res += ck[word]
                } else {
                    if (word.length > 0) {
                        characters = word.split("")
                        for (j = 0, wlen = characters.length; j < wlen; j++) {
                            if (typeof (ck[characters[j]]) != "undefined") {
                                res += ck[characters[j]]
                            } else {
                                res += characters[j]
                            }
                        }
                    } else {
                        res += word
                    }
                }
            }
        } else {
            for (i = 0, len = jieba.length; i < len; i++) {
                var word = jieba[i]['w'].trim(),
                    r = ck[word]
                if (typeof (r) != "undefined") {
                    res += ck[word]
                } else if (typeof (r) == "undefined") {
                    var wordPy = pinyinUtil.getPinyin(word, '', false, true)
                    if (typeof (indexa[wordPy]) != "undefined") {
                        res += ck[indexa[wordPy]]
                    } else {
                        if (word.length > 0) {
                            characters = word.split("")
                            for (j = 0, wlen = characters.length; j < wlen; j++) {
                                var character = characters[j]
                                if (typeof (ck[character]) != "undefined") {
                                    res += ck[character]
                                } else {
                                    var characterPy = pinyinUtil.getPinyin(character, '', false, true)
                                    if (typeof (indexa[characterPy]) != "undefined") {
                                        res += ck[indexa[characterPy]]
                                    } else {
                                        res += character
                                    }
                                }
                            }
                        } else {
                            res += word.trim()
                        }
                    }
                }
            }
        }
        if ($("input[id='checkda']").is(':checked') == true) {
            res = res.replace(/大/g, "带")
        }
        if ($("input[id='checkai']").is(':checked') == true) {
            res = res.replace(/💓/g, "i")
        }
        if ($("input[id='checkye']").is(':checked') == true) {
            res = res.replace(/我/g, "👴")
        }
    } else if (index == 1) {
        if ($("input[id='zhadd']").is(':checked') != true) {
            res = (($("#t1").val()).split("")).join(" ")
        } else {
            res = ($("#t1").val()).replace(/([\u4e00-\u9fa5])/g, " $1 ").replace(/  /g, " ").trim()
        }
    }
    $("#res").text(res)
    $('#copy').attr('data-clipboard-text', res)
});

var clipboard = new ClipboardJS('#copy');
clipboard.on('success', function (e) {
    mdui.snackbar({
        message: '复制成功'
    });
});
clipboard.on('error', function (e) {
    mdui.snackbar({
        message: '复制失败，用其他浏览器试试？'
    });
});