function generate() {
    var tmp = "1. " + $("#i_item").val() + "事男性，而野兽先辈毫无疑问也事男性。"
    if ($('#i_gender').val() == "女") { tmp = "1. 存在野兽先辈女子说，而" + $("#i_item").val() + "也事女子。"; }
    if ($('#i_gender').val() == "不确定") { tmp = "1. 野兽先辈既可以被论证为男子也可以被论证为女子，而" + $("#i_item").val() + "也没有确定的性别。"; }
    var tmp2 = "2. 野兽先辈在《真夏夜的银梦》中本色出演，事真实存在的人物；而" + $("#i_item").val() + "也在三次元中真实存在。"
    if ($('#i_illus').val() == "是") { tmp2 = "2. " + $("#i_item").val() + "事虚拟人物；而先辈也是《真夏夜的银梦》中的虚拟人物。"; }

    var length_check = $("#i_item").val().replace(/\s/g, "");
    var length = length_check.length
    var yajuu = {
        1: "1 + 1 + 4 - 5 * 1 ^ 4",
        2: "1 + 1 + 4 - 5 + 1 ^ 4",
        3: "1 + 1 - 4 + 5 * 1 ^ 4",
        4: "1 + 1 + 4 - 5 - 1 + 4",
        5: "1 + 1 + 4 - 5 + 1 * 4",
        6: "1 + 1 + 4 + 5 - 1 - 4",
        7: "1 + 1 + 4 + 5 - 1 * 4",
        8: "1 + 1 + 4 + 5 + 1 - 4",
        9: "1 + 1 * 4 + 5 - 1 ^ 4",
        10: "1 + 1 + 4 + 5 - 1 ^ 4",
        11: "1 + 1 + 4 + 5 * 1 ^ 4",
        12: "1 + 1 + 4 + 5 + 1 ^ 4",
        13: "1 + 1 * 4 + 5 - 1 + 4",
        14: "1 + 1 + 4 + 5 - 1 + 4",
        15: "1 + 1 + 4 + 5 + 1 * 4",
        16: "1 + 1 + 4 + 5 + 1 + 4",
        17: "1 + 1 + 4 * 5 - 1 - 4",
        18: "1 + 1 + 4 * 5 - 1 * 4",
        19: "1 + 1 + 4 * 5 + 1 - 4",
        20: "1 + 1 * 4 * 5 - 1 ^ 4",
        21: "1 + 1 + 4 * 5 - 1 ^ 4",
        22: "1 + 1 + 4 * 5 * 1 ^ 4",
        23: "1 + 1 + 4 * 5 + 1 ^ 4",
        24: "1 + 1 * 4 * 5 - 1 + 4",
        25: "1 + 1 + 4 * 5 - 1 + 4"
    };
    var template = "";
    template += "野兽先辈" + $("#i_item").val() + "说\n\n";
    template += tmp + "\n\n";
    template += tmp2 + "\n\n";
    template += "3. " + $("#i_item").val() + "比" + $("#i_whom").val() + "年长，事先辈；野兽先辈24岁事学生，也事先辈。\n\n"
    template += "4. 野兽先辈雷普后辈，事屑；" + $("#i_item").val() + "" + $("#i_what").val() + "，也事屑。\n\n";
    template += "5. " + $("#i_item").val() + "想要" + $("#i_dream").val() + "，事王道征途；野兽先辈也崇尚王道征途。 \n\n";
    template += "6. " + $("#i_item").val() + "虽然" + $("#i_what").val() + "，但也" + $("#i_good").val() + "，具备屑鉴二象性。野兽先辈虽然雷普后辈，却爆破了nico本社，也具备屑鉴二象性。\n\n"
    template += "7. " + $("#i_item").val() + "很无力，想" + $("#i_dream").val() + "，却连" + $("#i_no").val() + "都办不到；野兽先辈崇尚王道征途，却在雷普后辈时被一转攻势，也很无力。\n\n"
    template += "8. 在这篇屑论证中，" + $("#i_item").val() + "惨遭小鬼迫害；银梦已经dssq多年，先辈也惨遭十万甚至九万个小鬼迫害。\n\n"
    if (length < 26) { template += "数字论证：“" + $("#i_item").val() + "”事" + length + "个字。" + length + " = " + yajuu[length] + "\n\n"; }
    else { template += "数字论证：" + $("#i_item").val() + "的名字太长了，数字论证无力，你自裁罢\n\n"; }
    template += "最后，没有任何证据表明" + $("#i_item").val() + "一定不事野兽先辈。而基于以上论据，以及“如果一个东西长得像鸭子，游泳像鸭子，叫声像鸭子，那么它就是鸭子”的原理，我们可以完全确信，" + $("#i_item").val() + "就事野兽先辈。\n\n"
    template += "Q. E. D."
    return template
}